<?php defined('SYSPATH') or die('No direct script access.');

return array(
	'not_empty' => 'Поле `:param2` обязательно для заполнения',
	'min_length'=> 'Пароль должен содержать не менее :param2 символов',
	'matches' 	=> 'Пароли не совпадают',
	'email'     => 'В качестве логина укажие адрес email',
	'login_exist' => 'Такой логин уже зарегистрирован в системе, <a href="/user/login">авторизуйтесь</a> если он ваш.',
	'valid_org_type' => 'Неправильный тип компании',
	'captcha' => 'На картинке другое слово.',
	'i_agree'	=> array(
		'not_empty'	=> 'Правила размещения объявлений и условия использования сайта не были приняты',
	),	
);
