<?php defined('SYSPATH') or die('No direct script access.');

return array(
	'not_empty' 				=> '(Ошибка стр. :param4) Поле ":param3" обязательно для заполнения.',
	'not_0' 					=> '(Ошибка стр. :param4) Значение поля ":param3" должно быть больше нуля.',
	'check_city_value' 			=> '(Ошибка стр. :param4) В поле ":param3" указан город который не представлен на нашем сайте.',
	'check_dictionary_value' 	=> '(Ошибка стр. :param5) В поле ":param4" указано значение которое отсуствует в наших справочниках.',
	'check_contact' 			=> '(Ошибка стр. :param4) В поле ":param3" неправильный формат контакта.',
	'digit'						=> '(Ошибка стр. :param4) В поле ":param3" может быть только целое число.',
	'numeric'					=> '(Ошибка стр. :param4) Значение поля ":param3" не типа float',
	'check_photo'				=> '(Ошибка стр. :param4) В поле ":param3" указана ссылка на фото (или на директорию) которого нет в загруженном архиве.',
	'max_length'				=> '(Ошибка стр. :param5) Поле ":param4" должно содержать не более :param2 символов',	
	'min_value'					=> '(Ошибка стр. :param5) Значение поля `:param3` не может быть меньше 0',
	'max_value'					=> '(Ошибка стр. :param4) Значение поля `:param3` не можеть быть более 999999999',
);
