<?php defined('SYSPATH') or die('No direct script access.');

return array(
	'not_empty' 		=> 'Поле `:param2` обязательно для заполнения',
	'not_0' 			=> 'Значение поля `:param2` должно быть больше нуля',
	'empty_contacts' 	=> 'Необходимо добавить хотя бы один верифицированный контакт для связи. Подтверждение мобильного телефона по смс, городского - звонком из нашего контакт центра.',
	'blocked_contacts' 	=> ':contacts в черном списке',
	'login_failed' 		=> 'Невереное сочетание логина и пароля',
	'max_objects'		=> 'Вы подали максимальное количество объявлений в эту рубрику.',
	'min_length'		=> 'Количество символов должно быть минимум :param2',
	'max_length'		=> ':field должно содержать не более :param2 символов',	
	'max_limit_values'	=> 'Превышен лимит на количество значений',
);
