<?php defined('SYSPATH') or die('No direct script access.');

return array(
	'not_empty' 		=> 'Поле `:param2` обязательно для заполнения',
	'not_empty_html' 	=> 'Поле `:param2` обязательно для заполнения',	
	'not_0' 			=> 'Значение поля `:param2` должно быть больше нуля',
	'empty_contacts' 	=> 'Необходимо добавить хотя бы один верифицированный контакт для связи. Подтверждение мобильного телефона по смс, городского - звонком из нашего контакт центра.',
	'blocked_contacts' 	=> ':contacts в черном списке',
	'login_failed' 		=> 'Невереное сочетание логина и пароля',
	'max_objects'		=> 'Вы подали максимальное количество объявлений в эту рубрику.',
	'min_length'		=> 'Поле `:param3` должно содержать не менее :param2 символов',
	'max_length'		=> 'Поле `:param3` должно содержать не более :param2 символов',	
	'max_limit_values'	=> 'Превышен лимит на количество значений',
	'not_autorized'		=> 'Вы не авторизованы на сайте, введите логин и пароль',
	'digit'				=> 'В поле `:param2` введенное не числовое значение',
	'numeric'			=> 'В поле `:param2` введенное не числовое значение. Формат: x.y ',
	'not_empty_photo' 	=> 'Не загружен`:param2`',
	'inn' 				=> 'В поле `:param2` введен неправильный ИНН, возможно ошиблись в цифрах',
);
