<?php defined('SYSPATH') OR die('No direct access allowed.');

return array(
	"one_advert_category" => "Для исключения нечестной конкуренции в данную рубрику вы можете разместить только одно объявление. Пожалуйста, позаботьтесь о его качестве. Кроме того, необходимо будет указать минимум один подтвержденный мобильный телефон.",
	"premod_notice" => "<span style='color:red;margin-top:5px;'>Рубрика с предварительной модерацией. Объявление появится в поиске, после проверки</span>",
	"vakancy_law" => "Обращаем Ваше внимание, что в соответствии с законом РФ № 1032-1 от 19.04.1991 в ред. от 02.07.2013 г. запрещено размещать информацию, не имеющую отношения к профессиональными качествам работника, в том числе ограничивающую права или устанавливающую преимущества для соискателей: по полу; возрасту; семейному положению; гражданству; месту проживания; судимости (если иное не предусмотрено ТК РФ или должностной инструкцией); вредным привычкам; внешности и физическим качествам (рост, вес, дефекты речи и прочее), а также материальному состоянию соискателя (наличие автомобиля и т.д.)."
);